src/cf/src/InformationRegisters/ЦеныПродажи/ЦеныПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажи</name>
  <comment>Фиксированные цены по контрагенту; запись с пустым контрагентом - цена по умолчанию</comment>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныПродажи/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Фиксированные цены контрагента: по каждой номенклатуре запись по контрагенту,
// а при её отсутствии - запись с пустым контрагентом (цена по умолчанию).
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - покупатель (может быть пустым).
//  Номенклатура - СправочникСсылка.Номенклатура, Массив - товар или список товаров.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Цена, ЦенаВключаетНДС, Упаковка (всегда пустая);
//                    строки только по номенклатуре с ценой.
//
Функция ПрайсПокупателя(Контрагент, Номенклатура) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Цены.Номенклатура КАК Номенклатура,
	                      |	Цены.Контрагент КАК Контрагент,
	                      |	Цены.Цена КАК Цена,
	                      |	Цены.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	                      |	ВЫБОР
	                      |		КОГДА Цены.Контрагент = &Контрагент
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ КАК ПорядокКонтрагента
	                      |ПОМЕСТИТЬ ВТЦены
	                      |ИЗ
	                      |	РегистрСведений.ЦеныПродажи КАК Цены
	                      |ГДЕ
	                      |	Цены.Номенклатура В (&Номенклатура)
	                      |	И Цены.Контрагент В (&Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЦены.Номенклатура КАК Номенклатура,
	                      |	МИНИМУМ(ВТЦены.ПорядокКонтрагента) КАК ПорядокКонтрагента
	                      |ПОМЕСТИТЬ ВТЛучшие
	                      |ИЗ
	                      |	ВТЦены КАК ВТЦены
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТЦены.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЦены.Номенклатура КАК Номенклатура,
	                      |	ВТЦены.Цена КАК Цена,
	                      |	ВТЦены.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	                      |	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка
	                      |ИЗ
	                      |	ВТЛучшие КАК ВЗ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦены КАК ВТЦены
	                      |		ПО ВЗ.Номенклатура = ВТЦены.Номенклатура
	                      |			И ВЗ.ПорядокКонтрагента = ВТЦены.ПорядокКонтрагента");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти
